/*
    Запишите «O-большое» для каждой из следующих операций ?
*/

/*  Exercise 4.5
      Вывод значения каждого элемента массива.

    Answer:
      O(n)
*/

/*  Exercise 4.6
      Удвоение значения каждого элемента массива.

    Answer:
      O(n)
*/

/*  Exercise 4.7
      Удвоение значения только первого элемента массива.

    Answer:
      O(1)
*/

/*  Exercise 4.8
      Создание таблицы умножения для всех элементов массива. Например, если массив состоит
      из элементов [2, 3, 7, 8, 10], сначала каждый элемент умножается на 2, затем каждый
      элемент умножается на 3, затем на 7 и т. д.

    Answer:
      O(n^2)
*/
